In [1]:
import pandas as pd
import numpy as np

a1 = [60, 84, 80, 70, "문예부"]
a2 = [77, 62, 95, 85, "과학부"]
a3 = [61, 97, 72, np.nan, "농구부"]
a4 = [75, 65, 95, np.nan, "다도부"]
cols = ["국어", "영어", "수학", "과학", "소속"]
b1 = ["문예부", "과학부", "다도부"]
df = pd.DataFrame([a1, a2, a3, a4], index=list("ABCD"), columns=cols)

In [2]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [4]:
df["영어"]

A    84
B    62
C    97
D    65
Name: 영어, dtype: int64

In [5]:
df["영어"] > 80
# 영어 열에서 조건 내 불린값 추출

A     True
B    False
C     True
D    False
Name: 영어, dtype: bool

In [6]:
df.loc[df["영어"] > 80]
# 영어 열 조건에 맞는 행 추출

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
C  61  97  72   NaN  농구부

In [16]:
df.loc[df["영어"] > 80, ["국어", "영어", "수학"]]

   국어  영어  수학
A  60  84  80
C  61  97  72

In [18]:
cond1 = df["영어"] > 80
df.loc[cond1, "국어":"과학"]

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [20]:
cond1 = df["국어"] > 60
cond2 = df["수학"] > 75
df.loc[cond1 & cond2]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [21]:
df["과학"].isnull()

A    False
B    False
C     True
D     True
Name: 과학, dtype: bool

In [22]:
df.loc[df["과학"].isnull()]

   국어  영어  수학  과학   소속
C  61  97  72 NaN  농구부
D  75  65  95 NaN  다도부

In [23]:
df.loc[~df["과학"].isnull()]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부

In [24]:
df.loc[(~df["과학"].isnull()) | (df["수학"] > 90)]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [25]:
b1

['문예부', '과학부', '다도부']

In [26]:
df["소속"].isin(b1)

A     True
B     True
C    False
D     True
Name: 소속, dtype: bool

In [28]:
df.loc[df["소속"].isin(b1)]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부